데이터 시각화 4주차

# 1. 데이터 재형성_Reshaping Data

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = sns.load_dataset("mpg") # 자체 내장된 데이터를 불러오기

# 데이터 프레임 형성 확인 
df.shape  # shape만 치면 됨. 형태가 어떻게 돼? 시리즈 9개다

(398, 9)

In [3]:
df.head() # 상위 5개 보여줌

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

### .sort_values()
- 특정 열(시리즈)의 데이터를 기준으로 데이터프레임을 정렬

In [4]:
df.sort_values?

In [5]:
# df.sort_values(
#    by,
#    axis=0,
#    ascending=True, # 오름차순
#    inplace=False,
#    kind='quicksort',
#    na_position='last',
#    ignore_index=False,
#    key: 'ValueKeyFunc' = None,
#)

In [6]:
df.sort_values('mpg').head() # 해당 컬럼 값을 기준으로 정렬했음

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
28,9.0,8,304.0,193.0,4732,18.5,70,usa,hi 1200d
25,10.0,8,360.0,215.0,4615,14.0,70,usa,ford f250
26,10.0,8,307.0,200.0,4376,15.0,70,usa,chevy c20
103,11.0,8,400.0,150.0,4997,14.0,73,usa,chevrolet impala
124,11.0,8,350.0,180.0,3664,11.0,73,usa,oldsmobile omega

In [7]:
df.sort_values('cylinders').head() # n기통

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
111,18.0,3,70.0,90.0,2124,13.5,73,japan,maxda rx3
71,19.0,3,70.0,97.0,2330,13.5,72,japan,mazda rx2 coupe
334,23.7,3,70.0,100.0,2420,12.5,80,japan,mazda rx-7 gs
243,21.5,3,80.0,110.0,2720,13.5,77,japan,mazda rx-4
267,27.5,4,134.0,95.0,2560,14.2,78,japan,toyota corona

In [8]:
df.sort_values('mpg', ascending=False).head()
# ascnding = False : 역순 (높은 값부터 나옴)
# default는 True

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
322,46.6,4,86.0,65.0,2110,17.9,80,japan,mazda glc
329,44.6,4,91.0,67.0,1850,13.8,80,japan,honda civic 1500 gl
325,44.3,4,90.0,48.0,2085,21.7,80,europe,vw rabbit c (diesel)
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
326,43.4,4,90.0,48.0,2335,23.7,80,europe,vw dasher (diesel)

### df.rename
- 데이터프레임 내의 행, 열의 이름을 변경

In [9]:
df.rename(columns = {'model_year':'year'}).head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [10]:
df.head() # 바꾼줄 알았는데 원본 데이터는 그대로임

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [11]:
df = df.rename(columns = {'model_year':'year'}) # inplace는 파이썬은 권장하지 않기에, 변수에 저장하자.
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

### df.sort_index
- Index 별로 정렬

In [12]:
df.sort_index().head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

### df.reset_index
- Index가 없을 때, index를 생성해서 정렬

In [13]:
df.reset_index?

### df.drop
- 특정 컬럼(column)의 변수를 데이터에서 제거함

In [14]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [15]:
df2 = df.drop(columns=['mpg','year']) # 두 컬럼이 제거된, 변경된 사본으로 저장됨
df2.head()

,cylinders,displacement,horsepower,weight,acceleration,origin,name
0,8,307.0,130.0,3504,12.0,usa,chevrolet chevelle malibu
1,8,350.0,165.0,3693,11.5,usa,buick skylark 320
2,8,318.0,150.0,3436,11.0,usa,plymouth satellite
3,8,304.0,150.0,3433,12.0,usa,amc rebel sst
4,8,302.0,140.0,3449,10.5,usa,ford torino

In [16]:
df3 = df.drop(columns=['mpg','year', 'name'])
df3.head()

   cylinders  displacement  horsepower  weight  acceleration origin
0          8         307.0       130.0    3504          12.0    usa
1          8         350.0       165.0    3693          11.5    usa
2          8         318.0       150.0    3436          11.0    usa
3          8         304.0       150.0    3433          12.0    usa
4          8         302.0       140.0    3449          10.5    usa

# 2. 깔끔한 데이터 만들기(melt, pivot)
### pd.melt
- Gather columns into rows (열의 값을 모아서 행으로 변경)
- 녹여서 조작하겠다는 것

In [17]:
pd.melt?

In [18]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'}, # 키:값으로 딕셔너리 타입
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [19]:
# 열을 행으로 바꿔주겠음 melt
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [20]:
df2 = pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])
df2

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

ㄴ변수variable/값value

In [21]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [22]:
df3 = pd.melt(df, value_vars=['A', 'B', 'C'])
df3

  variable value
0        A     a
1        A     b
2        A     c
3        B     1
4        B     3
5        B     5
6        C     2
7        C     4
8        C     6

### method chaining
연속적으로 된다

In [23]:
df3 = pd.melt(df, value_vars=['A', 'B', 'C']).rename(columns={ # 업데이트
'variable':'var',
'value':'val'})

df3

  var val
0   A   a
1   A   b
2   A   c
3   B   1
4   B   3
5   B   5
6   C   2
7   C   4
8   C   6

### df.pivot
- spread rows into columns(행의 값을 열의 값으로 변경)

In [24]:
df4 = pd.DataFrame({'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                    'baz': [1, 2, 3, 4, 5, 6],
                    'foo': ['one', 'one', 'one', 'two', 'two','two']})

df4

  bar  baz  foo
0   A    1  one
1   B    2  one
2   C    3  one
3   A    4  two
4   B    5  two
5   C    6  two

In [25]:
df4.pivot(index='foo', columns='bar', values='baz') 
# foo 인덱스, 컬럼 bar, 값은 baz

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [26]:
df4.pivot(index='foo', columns='bar', values='baz').reset_index()
# index를 새로 생성 
# 멀티인덱스

bar  foo  A  B  C
0    one  1  2  3
1    two  4  5  6

In [27]:
df5 = df4.pivot(index='foo', columns='bar', values='baz').reset_index()
df5 # df5으로 저장

bar  foo  A  B  C
0    one  1  2  3
1    two  4  5  6

In [28]:
df5.melt(id_vars=['foo'], value_vars=['A', 'B', 'C'])
# melt함수로 보기 편하게 바꾸고 싶음
# 열-> 행으로

   foo bar  value
0  one   A      1
1  two   A      4
2  one   B      2
3  two   B      5
4  one   C      3
5  two   C      6

In [29]:
df5.melt(id_vars=['foo'], value_vars=['A', 'B', 'C']).sort_values(by=['bar'])
# sort_values 기준

   foo bar  value
0  one   A      1
1  two   A      4
2  one   B      2
3  two   B      5
4  one   C      3
5  two   C      6

In [30]:
df5.melt(id_vars=['foo'], value_vars=['A', 'B', 'C']).sort_values(by=['foo'])

   foo bar  value
0  one   A      1
2  one   B      2
4  one   C      3
1  two   A      4
3  two   B      5
5  two   C      6

In [31]:
df5.melt(id_vars=['foo'], value_vars=['A', 'B', 'C']).sort_values(by=['foo', 'bar'])
# 첫번째foo, 두번째bar 기준

   foo bar  value
0  one   A      1
2  one   B      2
4  one   C      3
1  two   A      4
3  two   B      5
5  two   C      6

In [32]:
df5.melt(id_vars=['foo'], value_vars=['A', 'B', 'C']).sort_values(
    by=['foo', 'bar']).rename(columns ={'value':'baz'})

   foo bar  baz
0  one   A    1
2  one   B    2
4  one   C    3
1  two   A    4
3  two   B    5
5  two   C    6

##### reshape는 두세 번씩 반복하면서 익혀야 한다.

# 3. 데이터 합치기 concat

In [33]:
pd.concat?

In [34]:
s1 = pd.Series(['a', 'b'])
s1

0    a
1    b
dtype: object

In [35]:
s2 = pd.Series(['c', 'd'])
s2

0    c
1    d
dtype: object

In [36]:
pd.concat([s1, s2]) # 열끼리

0    a
1    b
0    c
1    d
dtype: object

In [37]:
pd.concat([s1, s2], keys=['s1','s2']) # 키값 지정

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [38]:
pd.concat([s1, s2], keys=['s1', 's2',], names=['Series name', 'Row ID']) # 키값 이름 변경

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [39]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [40]:
df2 = pd.DataFrame([['c', 3], ['d', 4]],
                   columns=['letter', 'number'])
df2

  letter  number
0      c       3
1      d       4

In [41]:
# concat() 두 df 합치기
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [42]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                   columns=['letter', 'number', 'animal'])
# 원소값 3개씩 있음
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [43]:
df1

  letter  number
0      a       1
1      b       2

In [44]:
pd.concat([df1, df3]) 
# 크기가 다른 데이터프레임 합치기

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [45]:
pd.concat([df1, df3], join="inner") 
# 옵션으로 둘다 공통으로 가지고 있는 값으로 나타내기
# 합쳐지나 animal은 없음

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [46]:
pd.concat([df1, df3], sort=False) 
# sort : boolean, default False
# join : {'inner', 'outer'}, default 'outer'

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [47]:
pd.concat([df1, df3], sort=True)

  animal letter  number
0    NaN      a       1
1    NaN      b       2
0    cat      c       3
1    dog      d       4

In [48]:
pd.concat([df1, df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [49]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                   columns=['animal', 'name']) #naems 대신 columns 사용 
df4

   animal    name
0    bird   polly
1  monkey  george

In [50]:
df5 = pd.DataFrame([1], index=['a']) # 인덱스 a는 1
df5

   0
a  1

In [51]:
df6 = pd.DataFrame([2], index=['a']) # 인덱스 키값 이해
df6

   0
a  2

In [52]:
pd.concat([df5,df6], verify_integrity=True) 
# key 값 중복
# verify_integrity = True (검증) 
# verify_integrity 기본 디폴드가 false

ValueError: Indexes have overlapping values: Index(['a'], dtype='object')

In [53]:
# ValueError: Indexes have overlapping values: ['a'] 
# pd.concat([df5, df6], verify_integrity=True)

ㄴ 확인할 때 많이 쓰임!!

# 4. 데이터 합치기 Merge

In [54]:
adf = pd.DataFrame({"x1": ["A", "B", "C"], "x2": [1, 2, 3]}) 
# dict = {k:v}
# 딕셔너리나 기본 구조는 시리즈
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [55]:
bdf = pd.DataFrame({"x1": ["A", "B", "D"], "x3": ["T", "F", "T"]})
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [56]:
pd.merge?

In [57]:
#pd.merge(
#    left,
#    right,
#    how: str = 'inner', 두개의 공통의 값
#    on=None,
#    left_on=None,
#    right_on=None,
#    left_index: bool = False,
#    right_index: bool = False,
#    sort: bool = False,
#    suffixes=('_x', '_y'),
#    copy: bool = True,
#    indicator: bool = False,
#    validate=None,
#)

In [58]:
pd.merge(adf, bdf, how='left', on='x1')
# SQL
# adf 기준으로, 대신 x1을 기준으로
# left join (ABC로 병합), on 은 key를 중심으로 병합

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [59]:
pd.merge(adf, bdf, how='right', on='x1') 
# right join (ABD로 병합), on 은 key를 중심으로 병합

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [60]:
pd.merge(adf, bdf, how='inner', on='x1') 
# inner join: 두 데이터프레임이 동시에 해당하는 것만 병합

  x1  x2 x3
0  A   1  T
1  B   2  F

In [61]:
pd.merge(adf, bdf, how='outer', on='x1')
# outer join: 두 데이터프레임이의 모든 값을 병합

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

### Filtering여과 joins 
adf[adf.x1.isin(bdf.x1)]

In [62]:
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [63]:
adf.x1

0    A
1    B
2    C
Name: x1, dtype: object

In [64]:
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [65]:
bdf.x1

0    A
1    B
2    D
Name: x1, dtype: object

In [66]:
adf.x1.isin(bdf.x1) # bool

0     True
1     True
2    False
Name: x1, dtype: bool

In [68]:
adf[adf.x1.isin(bdf.x1)] # True인것만 보여줌

  x1  x2
0  A   1
1  B   2

In [69]:
adf[~adf.x1.isin(bdf.x1)] # ~ 을 제외하고 데이터를 가지고 옴

  x1  x2
2  C   3

새로운 예시

In [70]:
ydf = pd.DataFrame({"x1": ["A", "B", "C"], "x2": [1, 2, 3]})
ydf

  x1  x2
0  A   1
1  B   2
2  C   3

In [71]:
zdf = pd.DataFrame({"x1": ["B", "C", "D"], "x2": [2, 3, 4]})
zdf

  x1  x2
0  B   2
1  C   3
2  D   4

In [72]:
pd.merge(ydf, zdf) #default : inner join

  x1  x2
0  B   2
1  C   3

In [73]:
pd.merge(ydf, zdf, how='outer')

  x1  x2
0  A   1
1  B   2
2  C   3
3  D   4

In [74]:
pd.merge(ydf, zdf, how='outer', indicator=True)
#indicator(가르치다)=True: 어떻게(어디서 왔는지) 병합했는지 알려줌

  x1  x2      _merge
0  A   1   left_only
1  B   2        both
2  C   3        both
3  D   4  right_only

In [75]:
pd.merge(ydf, zdf, how='outer', indicator=True).query('_merge == "left_only"')
#query : 요청한 값만 가지고 옴(SQL)

  x1  x2     _merge
0  A   1  left_only

In [76]:
pd.merge(ydf, zdf, how='outer', indicator=True
        ).query('_merge == "left_only"'
               ).drop(columns=['_merge'])

  x1  x2
0  A   1

# 5. 데이터 집계 활용
### groupby

In [77]:
df = sns.load_dataset("mpg")
df.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

In [78]:
df.groupby(by="origin")

In [79]:
df.groupby(by="origin").size()
# origin 기준으로 크기별로 나눠줘.

origin
europe     70
japan      79
usa       249
dtype: int64

In [80]:
df["origin"].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [81]:
df.groupby(by="origin").min()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,16.2,4,68.0,46.0,1825,12.2,70,audi 100 ls
japan,18.0,3,70.0,52.0,1613,11.4,70,datsun 1200
usa,9.0,4,85.0,52.0,1800,8.0,70,amc ambassador brougham

In [82]:
df.groupby(by="origin").max()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,44.3,6,183.0,133.0,3820,24.8,82,vw rabbit custom
japan,46.6,6,168.0,132.0,2930,21.0,82,toyouta corona mark ii (sw)
usa,39.0,8,455.0,230.0,5140,22.2,82,pontiac ventura sj

In [83]:
df.groupby(by="origin").mean()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,27.891429,4.157143,109.142857,80.558824,2423.300000,16.787143,75.814286
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038
usa,20.083534,6.248996,245.901606,119.048980,3361.931727,15.033735,75.610442

In [84]:
df.groupby(by="origin")['cylinders'].size() 
# 특정 컬럼 값을 보고 싶을 때 
# 실린더 속성의 크기 순으로

origin
europe     70
japan      79
usa       249
Name: cylinders, dtype: int64

In [86]:
df.groupby(by="origin")['cylinders'].mean() 
# 특정컬럼값을 보고 싶을 때

origin
europe    4.157143
japan     4.101266
usa       6.248996
Name: cylinders, dtype: float64

In [87]:
df.groupby(by="origin")['cylinders'].median() 
# 특정컬럼값을 보고 싶을 때

origin
europe    4
japan     4
usa       6
Name: cylinders, dtype: int64

In [88]:
df.groupby(['model_year', 'origin'])['cylinders'].mean()
# 1순위 모델연도, 2순위 origin

model_year  origin
70          europe    4.000000
            japan     4.000000
            usa       7.636364
71          europe    4.000000
            japan     4.000000
            usa       6.200000
72          europe    4.000000
            japan     3.800000
            usa       6.888889
73          europe    4.000000
            japan     4.250000
            usa       7.241379
74          europe    4.000000
            japan     4.000000
            usa       6.266667
75          europe    4.000000
            japan     4.000000
            usa       6.400000
76          europe    4.250000
            japan     4.500000
            usa       6.363636
77          europe    4.000000
            japan     4.166667
            usa       6.222222
78          europe    4.833333
            japan     4.000000
            usa       6.000000
79          europe    4.250000
            japan     4.000000
            usa       6.260870
80          europe    4.111111
            japan     4.076923
            usa       4.285714
81          europe    4.500000
            japan     4.333333
            usa       4.923077
82          europe    4.000000
            japan     4.000000
            usa       4.300000
Name: cylinders, dtype: float64

In [89]:
pd.DataFrame(df.groupby(['model_year', 'origin'])['cylinders'].mean())

                   cylinders
model_year origin
70         europe   4.000000
           japan    4.000000
           usa      7.636364
71         europe   4.000000
           japan    4.000000
           usa      6.200000
72         europe   4.000000
           japan    3.800000
           usa      6.888889
73         europe   4.000000
           japan    4.250000
           usa      7.241379
74         europe   4.000000
           japan    4.000000
           usa      6.266667
75         europe   4.000000
           japan    4.000000
           usa      6.400000
76         europe   4.250000
           japan    4.500000
           usa      6.363636
77         europe   4.000000
           japan    4.166667
           usa      6.222222
78         europe   4.833333
           japan    4.000000
           usa      6.000000
79         europe   4.250000
           japan    4.000000
           usa      6.260870
80         europe   4.111111
           japan    4.076923
           usa      4.285714
81         europe   4.500000
           japan    4.333333
           usa      4.923077
82         europe   4.000000
           japan    4.000000
           usa      4.300000

새로운 예시

In [90]:
df2 = pd.DataFrame(
[[4, 7, 10],
[5, 11, 8],
[6, 9, 12]],
index=[1, 2, 3],
columns=['a', 'b', 'c'])
df2

   a   b   c
1  4   7  10
2  5  11   8
3  6   9  12

In [91]:
df2.shift(1) 
# 아래 행(인덱스) 방향으로 하나씩 shift(이동)함

     a     b     c
1  NaN   NaN   NaN
2  4.0   7.0  10.0
3  5.0  11.0   8.0

In [92]:
df2

   a   b   c
1  4   7  10
2  5  11   8
3  6   9  12

In [93]:
df2.shift(-1) # 위 행 방향으로 하나씩 shift(이동)함

     a     b     c
1  5.0  11.0   8.0
2  6.0   9.0  12.0
3  NaN   NaN   NaN

In [94]:
df2

   a   b   c
1  4   7  10
2  5  11   8
3  6   9  12

In [95]:
df2['b'].shift(-1) 
# 특정 column(열)을 이동할 경우

1    11.0
2     9.0
3     NaN
Name: b, dtype: float64

In [97]:
df2['b'].shift(2)

1    NaN
2    NaN
3    7.0
Name: b, dtype: float64

### rank
순위

In [98]:
df["model_year"].head()

0    70
1    70
2    70
3    70
4    70
Name: model_year, dtype: int64

In [99]:
df["model_year"].rank(method='min')

0        1.0
1        1.0
2        1.0
3        1.0
4        1.0
       ...
393    368.0
394    368.0
395    368.0
396    368.0
397    368.0
Name: model_year, Length: 398, dtype: float64

In [100]:
df["model_year"].rank(method='min').value_counts()

86.0     40
245.0    36
183.0    34
368.0    31
153.0    30
339.0    29
1.0      29
310.0    29
281.0    29
58.0     28
217.0    28
30.0     28
126.0    27
Name: model_year, dtype: int64

In [101]:
df["model_year"].rank(method='max')

0       29.0
1       29.0
2       29.0
3       29.0
4       29.0
       ...
393    398.0
394    398.0
395    398.0
396    398.0
397    398.0
Name: model_year, Length: 398, dtype: float64

In [102]:
df["model_year"].rank(pct=True) 
#pct: 비율이 어느 정도인지 알려줌

0      0.037688
1      0.037688
2      0.037688
3      0.037688
4      0.037688
         ...
393    0.962312
394    0.962312
395    0.962312
396    0.962312
397    0.962312
Name: model_year, Length: 398, dtype: float64

In [103]:
df["model_year"].rank(method='first').head()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: model_year, dtype: float64

새로운 예시

In [104]:
df2

   a   b   c
1  4   7  10
2  5  11   8
3  6   9  12

In [105]:
df2.cumsum() # 누적 합

    a   b   c
1   4   7  10
2   9  18  18
3  15  27  30

In [106]:
df2.cummax()

   a   b   c
1  4   7  10
2  5  11  10
3  6  11  12

In [107]:
df2.cummin()

   a  b   c
1  4  7  10
2  4  7   8
3  4  7   8

In [108]:
df2.cumprod() #누적 곱 (cumulative product)

     a    b    c
1    4    7   10
2   20   77   80
3  120  693  960

--- seYi